IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_epwm_regs.xml
	<register id="ETSEL" width="16" page="1" offset="0xa4" internal="0" description="Event Trigger Selection Register">
		<bitfield id="INTSEL" description="EPWMxINTn Select" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="INTEN" description="EPWMxINTn Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOCASELCMP" description="EPWMxSOCA Compare Select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOCBSELCMP" description="EPWMxSOCB Compare Select" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTSELCMP" description="EPWMxINT Compare Select" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOCASEL" description="Start of Conversion A Select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="SOCAEN" description="Start of Conversion A Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOCBSEL" description="Start of Conversion B Select" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="SOCBEN" description="Start of Conversion B Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ETPS" width="16" page="1" offset="0xa6" internal="0" description="Event Trigger Pre-Scale Register">
		<bitfield id="INTPRD" description="EPWMxINTn Period Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INTCNT" description="EPWMxINTn Counter Register" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="INTPSSEL" description="EPWMxINTn Pre-Scale Selection Bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOCPSSEL" description="EPWMxSOC A/B  Pre-Scale Selection Bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOCAPRD" description="EPWMxSOCA Period Select" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SOCACNT" description="EPWMxSOCA Counter Register" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="SOCBPRD" description="EPWMxSOCB Period Select" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SOCBCNT" description="EPWMxSOCB Counter" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="ETFLG" width="16" page="1" offset="0xa8" internal="0" description="Event Trigger Flag Register">
		<bitfield id="INT" description="EPWMxINTn Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SOCA" description="EPWMxSOCA Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SOCB" description="EPWMxSOCB Flag" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="ETCLR" width="16" page="1" offset="0xaa" internal="0" description="Event Trigger Clear Register">
		<bitfield id="INT" description="EPWMxINTn Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOCA" description="EPWMxSOCA Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOCB" description="EPWMxSOCB Clear" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ETFRC" width="16" page="1" offset="0xac" internal="0" description="Event Trigger Force Register">
		<bitfield id="INT" description="EPWMxINTn Force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOCA" description="EPWMxSOCA Force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOCB" description="EPWMxSOCB Force" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ETINTPS" width="16" page="1" offset="0xae" internal="0" description="Event-Trigger Interrupt Pre-Scale Register">
		<bitfield id="INTPRD2" description="EPWMxINTn Period Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="INTCNT2" description="EPWMxINTn Counter Register" begin="7" end="4" width="4" rwaccess="R"/>
	</register>
	<register id="ETSOCPS" width="16" page="1" offset="0xb0" internal="0" description="Event-Trigger SOC Pre-Scale Register">
		<bitfield id="SOCAPRD2" description="EPWMxSOCA Period Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SOCACNT2" description="EPWMxSOCA Counter Register" begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="SOCBPRD2" description="EPWMxSOCB Period Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="SOCBCNT2" description="EPWMxSOCB Counter Register" begin="15" end="12" width="4" rwaccess="R"/>
	</register>
	<register id="ETCNTINITCTL" width="16" page="1" offset="0xb2" internal="0" description="Event-Trigger Counter Initialization Control Register">
		<bitfield id="INTINITFRC" description="EPWMxINT Counter Initialization Force" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SOCAINITFRC" description="EPWMxSOCA Counter Initialization Force" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOCBINITFRC" description="EPWMxSOCB Counter Initialization Force" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTINITEN" description="EPWMxINT Counter Initialization Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SOCAINITEN" description="EPWMxSOCA Counter Initialization Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SOCBINITEN" description="EPWMxSOCB Counter Initialization Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ETCNTINIT" width="16" page="1" offset="0xb4" internal="0" description="Event-Trigger Counter Initialization Register">
		<bitfield id="INTINIT" description="EPWMxINT Counter Initialization Bits" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SOCAINIT" description="EPWMxSOCA Counter Initialization Bits" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="SOCBINIT" description="EPWMxSOCB Counter Initialization Bits" begin="11" end="8" width="4" rwaccess="RW"/>
	</register>
	<register id="DCTRIPSEL" width="16" page="1" offset="0xc0" internal="0" description="Digital Compare Trip Select Register">
		<bitfield id="DCAHCOMPSEL" description="Digital Compare A High COMP Input Select " begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="DCALCOMPSEL" description="Digital Compare A Low COMP Input Select " begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="DCBHCOMPSEL" description="Digital Compare B High COMP Input Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="DCBLCOMPSEL" description="Digital Compare B Low COMP Input Select" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DCACTL" width="16" page="1" offset="0xc3" internal="0" description="Digital Compare A Control Register">
		<bitfield id="EVT1SRCSEL" description="DCAEVT1 Source Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT1FRCSYNCSEL" description="DCAEVT1 Force Sync Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT1SOCE" description="DCAEVT1 SOC Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT1SYNCE" description="DCAEVT1 SYNC Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT1LATSEL" description="DCAEVT1 Latched signal select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT1LATCLRSEL" description="DCAEVT1 Latched clear source select" begin="6" end="5" width="2" rwaccess="RW"/>
		<bitfield id="EVT1LAT" description="Indicates the status of DCAEVT1LAT signal." begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EVT2SRCSEL" description="DCAEVT2 Source Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EVT2FRCSYNCSEL" description="DCAEVT2 Force Sync Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EVT2LATSEL" description="DCAEVT2 Latched signal select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EVT2LATCLRSEL" description="DCAEVT2 Latched clear source select" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="EVT2LAT" description="Indicates the status of DCAEVT2LAT signal." begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="DCBCTL" width="16" page="1" offset="0xc4" internal="0" description="Digital Compare B Control Register">
		<bitfield id="EVT1SRCSEL" description="DCBEVT1 Source Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EVT1FRCSYNCSEL" description="DCBEVT1 Force Sync Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EVT1SOCE" description="DCBEVT1 SOC Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVT1SYNCE" description="DCBEVT1 SYNC Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EVT1LATSEL" description="DCBEVT1 Latched signal select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVT1LATCLRSEL" description="DCBEVT1 Latched clear source select" begin="6" end="5" width="2" rwaccess="RW"/>
		<bitfield id="EVT1LAT" description="Indicates the status of DCBEVT1LAT signal." begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EVT2SRCSEL" description="DCBEVT2 Source Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EVT2FRCSYNCSEL" description="DCBEVT2 Force Sync Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EVT2LATSEL" description="DCBEVT2 Latched signal select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EVT2LATCLRSEL" description="DCBEVT2 Latched clear source select" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="EVT2LAT" description="Indicates the status of DCBEVT2LAT signal." begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="DCFCTL" width="16" page="1" offset="0xc7" internal="0" description="Digital Compare Filter Control Register">
		<bitfield id="SRCSEL" description="Filter Block Signal Source Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="BLANKE" description="Blanking Enable/Disable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="BLANKINV" description="Blanking Window Inversion" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PULSESEL" description="Pulse Select for Blanking and Capture Alignment" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="EDGEFILTSEL" description="Edge Filter Select" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EDGEMODE" description="Edge Mode" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="EDGECOUNT" description="Edge Count" begin="12" end="10" width="3" rwaccess="RW"/>
		<bitfield id="EDGESTATUS" description="Edge Status" begin="15" end="13" width="3" rwaccess="R"/>
	</register>
	<register id="DCCAPCTL" width="16" page="1" offset="0xc8" internal="0" description="Digital Compare Capture Control Register">
		<bitfield id="CAPE" description="Counter Capture Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SHDWMODE" description="Counter Capture Mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CAPSTS" description="Latched Status Flag for Capture Event" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CAPCLR" description="DC Capture Latched Status Clear Flag" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CAPMODE" description="Counter Capture Mode" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="DCFOFFSET" width="16" page="1" offset="0xc9" internal="0" description="Digital Compare Filter Offset Register ">
		<bitfield id="DCFOFFSET" description="Blanking Offset" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DCFOFFSETCNT" width="16" page="1" offset="0xca" internal="0" description="Digital Compare Filter Offset Counter Register">
		<bitfield id="DCFOFFSETCNT" description="Blanking Offset Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
